<?xml version="1.0"?>
<net name="tokenizer" version="11">
	<layers>
		<layer id="0" name="Parameter_83019" type="Parameter" version="opset1">
			<data shape="?" element_type="string" />
			<output>
				<port id="0" precision="STRING" names="Parameter_83019">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_83130" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="2" name="Constant_83131" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="3" name="Constant_83132" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="8" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_83025" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="5" name="StringTensorUnpack_83020" type="StringTensorUnpack" version="opset15">
			<input>
				<port id="0" precision="STRING">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="ShapeOf_83021" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_83022" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="Constant_83023" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="9" name="Gather_83024" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" />
			</output>
		</layer>
		<layer id="10" name="Constant_83026" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="20" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="11" name="Range_83027" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_83028" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="20" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="13" name="Constant_83029" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="20" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="14" name="Add_83030" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="15" name="Constant_83031" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="20" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="16" name="Range_83032" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_83094" type="Const" version="opset1">
			<data element_type="u8" shape="443" offset="28" size="443" />
			<output>
				<port id="0" precision="U8">
					<dim>443</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="SpecialTokensSplit_83095" type="SpecialTokensSplit" version="extension">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="U8">
					<dim>443</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="11" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="CharsMapNormalization_83096" type="CharsMapNormalization" version="extension">
			<data add_dummy_prefix="false" remove_extra_whitespaces="false" escape_whitespaces="false" normalization_form="nfc" case_fold="false" nmt="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="3" precision="BOOL">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="7" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_83098" type="Const" version="opset1">
			<data element_type="u8" shape="110" offset="471" size="110" />
			<output>
				<port id="0" precision="U8">
					<dim>110</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="RegexSplit_83099" type="RegexSplit" version="extension">
			<data behaviour="isolate" invert="false" max_splits="-1" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="BOOL">
					<dim>-1</dim>
				</port>
				<port id="6" precision="U8">
					<dim>110</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="11" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="12" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_83101" type="Const" version="opset1">
			<data element_type="i32" shape="151665" offset="581" size="606660" />
			<output>
				<port id="0" precision="I32">
					<dim>151665</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_83103" type="Const" version="opset1">
			<data element_type="i32" shape="151665" offset="607241" size="606660" />
			<output>
				<port id="0" precision="I32">
					<dim>151665</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_83105" type="Const" version="opset1">
			<data element_type="u8" shape="976273" offset="1213901" size="976273" />
			<output>
				<port id="0" precision="U8">
					<dim>976273</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_83113" type="Const" version="opset1">
			<data element_type="i32" shape="151387" offset="2190174" size="605548" />
			<output>
				<port id="0" precision="I32">
					<dim>151387</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_83115" type="Const" version="opset1">
			<data element_type="i32" shape="151387" offset="2795722" size="605548" />
			<output>
				<port id="0" precision="I32">
					<dim>151387</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_83117" type="Const" version="opset1">
			<data element_type="u8" shape="491359" offset="3401270" size="491359" />
			<output>
				<port id="0" precision="U8">
					<dim>491359</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_83119" type="Const" version="opset1">
			<data element_type="i32" shape="151387" offset="3892629" size="605548" />
			<output>
				<port id="0" precision="I32">
					<dim>151387</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_83121" type="Const" version="opset1">
			<data element_type="i32" shape="151387" offset="4498177" size="605548" />
			<output>
				<port id="0" precision="I32">
					<dim>151387</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_83123" type="Const" version="opset1">
			<data element_type="u8" shape="484354" offset="5103725" size="484354" />
			<output>
				<port id="0" precision="U8">
					<dim>484354</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_83107" type="Const" version="opset1">
			<data element_type="i32" shape="22" offset="5588079" size="88" />
			<output>
				<port id="0" precision="I32">
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_83109" type="Const" version="opset1">
			<data element_type="i32" shape="22" offset="5588167" size="88" />
			<output>
				<port id="0" precision="I32">
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_83111" type="Const" version="opset1">
			<data element_type="u8" shape="304" offset="5588255" size="304" />
			<output>
				<port id="0" precision="U8">
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_83124" type="Const" version="opset1">
			<data element_type="i32" shape="22" offset="5588559" size="88" />
			<output>
				<port id="0" precision="I32">
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="BPETokenizer_83125" type="BPETokenizer" version="extension">
			<data unk_token="" fuse_unk="false" suffix_indicator="" end_suffix="" byte_fallback="false" cache_capacity="30328" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>151665</dim>
				</port>
				<port id="6" precision="I32">
					<dim>151665</dim>
				</port>
				<port id="7" precision="U8">
					<dim>976273</dim>
				</port>
				<port id="8" precision="I32">
					<dim>151387</dim>
				</port>
				<port id="9" precision="I32">
					<dim>151387</dim>
				</port>
				<port id="10" precision="U8">
					<dim>491359</dim>
				</port>
				<port id="11" precision="I32">
					<dim>151387</dim>
				</port>
				<port id="12" precision="I32">
					<dim>151387</dim>
				</port>
				<port id="13" precision="U8">
					<dim>484354</dim>
				</port>
				<port id="14" precision="I32">
					<dim>22</dim>
				</port>
				<port id="15" precision="I32">
					<dim>22</dim>
				</port>
				<port id="16" precision="U8">
					<dim>304</dim>
				</port>
				<port id="17" precision="I32">
					<dim>22</dim>
				</port>
			</input>
			<output>
				<port id="18" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="19" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="20" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Subtract_83126" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_83127" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="5588647" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="38" name="Minimum_83128" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Subtract_83129" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_83133" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="12" size="8" />
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="CombineSegments_83134" type="CombineSegments" version="extension">
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="11" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="12" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Subtract_83135" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_83136" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="44" name="ReduceMax_83137" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" />
			</output>
		</layer>
		<layer id="45" name="Constant_83138" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="5588651" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="46" name="RaggedToDense_83139" type="RaggedToDense" version="extension">
			<data pad_right="false" m_pad_max_length="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32" />
				<port id="4" precision="I32" />
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="6" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Convert_83140" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Convert_83140.0" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="RaggedToDense_83139.0" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Result_83143" type="Result" version="opset1" output_names="input_ids">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
		<layer id="49" name="Result_83145" type="Result" version="opset1" output_names="attention_mask">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="41" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="41" to-port="1" />
		<edge from-layer="3" from-port="0" to-layer="41" to-port="2" />
		<edge from-layer="4" from-port="0" to-layer="11" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="18" to-port="2" />
		<edge from-layer="5" from-port="2" to-layer="18" to-port="3" />
		<edge from-layer="5" from-port="3" to-layer="18" to-port="4" />
		<edge from-layer="6" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="9" to-port="1" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="2" />
		<edge from-layer="9" from-port="3" to-layer="11" to-port="1" />
		<edge from-layer="9" from-port="3" to-layer="14" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="2" />
		<edge from-layer="11" from-port="3" to-layer="18" to-port="0" />
		<edge from-layer="12" from-port="0" to-layer="16" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="16" to-port="1" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="2" />
		<edge from-layer="16" from-port="3" to-layer="18" to-port="1" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="5" />
		<edge from-layer="18" from-port="11" to-layer="19" to-port="3" />
		<edge from-layer="18" from-port="6" to-layer="21" to-port="0" />
		<edge from-layer="18" from-port="7" to-layer="21" to-port="1" />
		<edge from-layer="18" from-port="8" to-layer="19" to-port="0" />
		<edge from-layer="18" from-port="10" to-layer="19" to-port="2" />
		<edge from-layer="18" from-port="9" to-layer="19" to-port="1" />
		<edge from-layer="19" from-port="7" to-layer="21" to-port="5" />
		<edge from-layer="19" from-port="4" to-layer="21" to-port="2" />
		<edge from-layer="19" from-port="5" to-layer="21" to-port="3" />
		<edge from-layer="19" from-port="6" to-layer="21" to-port="4" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="6" />
		<edge from-layer="21" from-port="7" to-layer="35" to-port="0" />
		<edge from-layer="21" from-port="8" to-layer="35" to-port="1" />
		<edge from-layer="21" from-port="9" to-layer="35" to-port="2" />
		<edge from-layer="21" from-port="10" to-layer="35" to-port="3" />
		<edge from-layer="21" from-port="11" to-layer="35" to-port="4" />
		<edge from-layer="22" from-port="0" to-layer="35" to-port="5" />
		<edge from-layer="23" from-port="0" to-layer="35" to-port="6" />
		<edge from-layer="24" from-port="0" to-layer="35" to-port="7" />
		<edge from-layer="25" from-port="0" to-layer="35" to-port="8" />
		<edge from-layer="26" from-port="0" to-layer="35" to-port="9" />
		<edge from-layer="27" from-port="0" to-layer="35" to-port="10" />
		<edge from-layer="28" from-port="0" to-layer="35" to-port="11" />
		<edge from-layer="29" from-port="0" to-layer="35" to-port="12" />
		<edge from-layer="30" from-port="0" to-layer="35" to-port="13" />
		<edge from-layer="31" from-port="0" to-layer="35" to-port="14" />
		<edge from-layer="32" from-port="0" to-layer="35" to-port="15" />
		<edge from-layer="33" from-port="0" to-layer="35" to-port="16" />
		<edge from-layer="34" from-port="0" to-layer="35" to-port="17" />
		<edge from-layer="35" from-port="19" to-layer="36" to-port="0" />
		<edge from-layer="35" from-port="18" to-layer="36" to-port="1" />
		<edge from-layer="35" from-port="19" to-layer="41" to-port="4" />
		<edge from-layer="35" from-port="20" to-layer="41" to-port="5" />
		<edge from-layer="35" from-port="19" to-layer="39" to-port="0" />
		<edge from-layer="36" from-port="2" to-layer="38" to-port="0" />
		<edge from-layer="37" from-port="0" to-layer="38" to-port="1" />
		<edge from-layer="38" from-port="2" to-layer="39" to-port="1" />
		<edge from-layer="39" from-port="2" to-layer="41" to-port="3" />
		<edge from-layer="40" from-port="0" to-layer="41" to-port="6" />
		<edge from-layer="41" from-port="8" to-layer="42" to-port="0" />
		<edge from-layer="41" from-port="7" to-layer="42" to-port="1" />
		<edge from-layer="41" from-port="7" to-layer="46" to-port="0" />
		<edge from-layer="41" from-port="8" to-layer="46" to-port="1" />
		<edge from-layer="41" from-port="9" to-layer="46" to-port="2" />
		<edge from-layer="42" from-port="2" to-layer="44" to-port="0" />
		<edge from-layer="43" from-port="0" to-layer="44" to-port="1" />
		<edge from-layer="44" from-port="2" to-layer="46" to-port="3" />
		<edge from-layer="45" from-port="0" to-layer="46" to-port="4" />
		<edge from-layer="46" from-port="6" to-layer="47" to-port="0" />
		<edge from-layer="46" from-port="5" to-layer="50" to-port="0" />
		<edge from-layer="47" from-port="1" to-layer="48" to-port="0" />
		<edge from-layer="48" from-port="1" to-layer="49" to-port="0" />
		<edge from-layer="50" from-port="1" to-layer="51" to-port="0" />
	</edges>
	<rt_info>
		<add_attention_mask value="True" />
		<add_prefix_space />
		<add_special_tokens value="True" />
		<bos_token_id value="151646" />
		<chat_template value="{% if not add_generation_prompt is defined %}{% set add_generation_prompt = false %}{% endif %}{% set ns = namespace(is_first=false, is_tool=false, is_output_first=true, system_prompt='') %}{%- for message in messages %}{%- if message['role'] == 'system' %}{% set ns.system_prompt = message['content'] %}{%- endif %}{%- endfor %}{{bos_token}}{{ns.system_prompt}}{%- for message in messages %}{%- if message['role'] == 'user' %}{%- set ns.is_tool = false -%}{{'&lt;｜User｜>' + message['content']}}{%- endif %}{%- if message['role'] == 'assistant' and message['content'] is none %}{%- set ns.is_tool = false -%}{%- for tool in message['tool_calls']%}{%- if not ns.is_first %}{{'&lt;｜Assistant｜>&lt;｜tool▁calls▁begin｜>&lt;｜tool▁call▁begin｜>' + tool['type'] + '&lt;｜tool▁sep｜>' + tool['function']['name'] + '\n' + '```json' + '\n' + tool['function']['arguments'] + '\n' + '```' + '&lt;｜tool▁call▁end｜>'}}{%- set ns.is_first = true -%}{%- else %}{{'\n' + '&lt;｜tool▁call▁begin｜>' + tool['type'] + '&lt;｜tool▁sep｜>' + tool['function']['name'] + '\n' + '```json' + '\n' + tool['function']['arguments'] + '\n' + '```' + '&lt;｜tool▁call▁end｜>'}}{{'&lt;｜tool▁calls▁end｜>&lt;｜end▁of▁sentence｜>'}}{%- endif %}{%- endfor %}{%- endif %}{%- if message['role'] == 'assistant' and message['content'] is not none %}{%- if ns.is_tool %}{{'&lt;｜tool▁outputs▁end｜>' + message['content'] + '&lt;｜end▁of▁sentence｜>'}}{%- set ns.is_tool = false -%}{%- else %}{% set content = message['content'] %}{% if '&lt;/think>' in content %}{% set content = content.split('&lt;/think>')[-1] %}{% endif %}{{'&lt;｜Assistant｜>' + content + '&lt;｜end▁of▁sentence｜>'}}{%- endif %}{%- endif %}{%- if message['role'] == 'tool' %}{%- set ns.is_tool = true -%}{%- if ns.is_output_first %}{{'&lt;｜tool▁outputs▁begin｜>&lt;｜tool▁output▁begin｜>' + message['content'] + '&lt;｜tool▁output▁end｜>'}}{%- set ns.is_output_first = false %}{%- else %}{{'\n&lt;｜tool▁output▁begin｜>' + message['content'] + '&lt;｜tool▁output▁end｜>'}}{%- endif %}{%- endif %}{%- endfor -%}{% if ns.is_tool %}{{'&lt;｜tool▁outputs▁end｜>'}}{% endif %}{% if add_generation_prompt and not ns.is_tool %}{{'&lt;｜Assistant｜>'}}{% endif %}" />
		<clean_up_tokenization_spaces />
		<detokenizer_input_type value="i64" />
		<eos_token_id value="151643" />
		<handle_special_tokens_with_re />
		<max_length />
		<number_of_inputs value="1" />
		<openvino_tokenizers_version value="2025.1.0.0-523-710ddf14de8" />
		<openvino_version value="2025.1.0-18503-6fec06580ab-releases/2025/1" />
		<original_post_processor_template value="{&quot;type&quot;: &quot;TemplateProcessing&quot;, &quot;single&quot;: [{&quot;SpecialToken&quot;: {&quot;id&quot;: &quot;&lt;\uff5cbegin\u2581of\u2581sentence\uff5c>&quot;, &quot;type_id&quot;: 0}}, {&quot;Sequence&quot;: {&quot;id&quot;: &quot;A&quot;, &quot;type_id&quot;: 0}}], &quot;pair&quot;: [{&quot;SpecialToken&quot;: {&quot;id&quot;: &quot;&lt;\uff5cbegin\u2581of\u2581sentence\uff5c>&quot;, &quot;type_id&quot;: 0}}, {&quot;Sequence&quot;: {&quot;id&quot;: &quot;A&quot;, &quot;type_id&quot;: 0}}, {&quot;SpecialToken&quot;: {&quot;id&quot;: &quot;&lt;\uff5cbegin\u2581of\u2581sentence\uff5c>&quot;, &quot;type_id&quot;: 1}}, {&quot;Sequence&quot;: {&quot;id&quot;: &quot;B&quot;, &quot;type_id&quot;: 1}}], &quot;special_tokens&quot;: {&quot;&lt;\uff5cbegin\u2581of\u2581sentence\uff5c>&quot;: {&quot;id&quot;: &quot;&lt;\uff5cbegin\u2581of\u2581sentence\uff5c>&quot;, &quot;ids&quot;: [151646], &quot;tokens&quot;: [&quot;&lt;\uff5cbegin\u2581of\u2581sentence\uff5c>&quot;]}}}" />
		<original_tokenizer_class value="&lt;class 'transformers.models.llama.tokenization_llama_fast.LlamaTokenizerFast'>" />
		<pad_token_id value="151643" />
		<processed_post_processor_template value="{&quot;single&quot;: {&quot;ids&quot;: [151646, -1], &quot;type_ids&quot;: [0, 0]}, &quot;pair&quot;: {&quot;ids&quot;: [151646, -1, 151646, -2], &quot;type_ids&quot;: [0, 0, 1, 1]}}" />
		<sentencepiece_version value="0.2.0" />
		<simplified_chat_template value="{% for message in messages %}{% if loop.first %}{{ '&lt;｜begin▁of▁sentence｜>' }}{% endif %}{% if message['role'] == 'system' and message['content'] %}{{ message['content'] }}{% elif message['role'] == 'user' %}{{  '&lt;｜User｜>' +  message['content'] }}{% elif message['role'] == 'assistant' %}{{ '&lt;｜Assistant｜>' +  message['content'] + '&lt;｜end▁of▁sentence｜>' }}{% endif %}{% if loop.last and add_generation_prompt %}{{ '&lt;｜Assistant｜>' }}{% endif %}{% endfor %}" />
		<skip_special_tokens value="True" />
		<streaming_detokenizer value="False" />
		<tokenizer_output_type value="i64" />
		<tokenizers_version value="0.21.1" />
		<transformers_version value="4.51.3" />
		<use_max_padding value="False" />
		<use_sentencepiece_backend value="False" />
		<utf8_replace_mode value="replace" />
		<with_detokenizer value="True" />
	</rt_info>
</net>
