<?xml version="1.0"?>
<net name="detokenizer" version="11">
	<layers>
		<layer id="0" name="Parameter_66466" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="Parameter_66466">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Convert_66641" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_66421" type="Const" version="opset1">
			<data element_type="i32" shape="32000" offset="0" size="128000" />
			<output>
				<port id="0" precision="I32">
					<dim>32000</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_66423" type="Const" version="opset1">
			<data element_type="i32" shape="32000" offset="128000" size="128000" />
			<output>
				<port id="0" precision="I32">
					<dim>32000</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_66425" type="Const" version="opset1">
			<data element_type="u8" shape="210919" offset="256000" size="210919" />
			<output>
				<port id="0" precision="U8">
					<dim>210919</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Slice_66471" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="466919" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="VocabDecoder_66473" type="VocabDecoder" version="extension">
			<data skip_tokens="" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>32000</dim>
				</port>
				<port id="2" precision="I32">
					<dim>32000</dim>
				</port>
				<port id="3" precision="U8">
					<dim>210919</dim>
				</port>
				<port id="4" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_66475" type="Const" version="opset1">
			<data element_type="u8" shape="3" offset="466931" size="3" />
			<output>
				<port id="0" precision="U8">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_66477" type="Const" version="opset1">
			<data element_type="u8" shape="1" offset="466934" size="1" />
			<output>
				<port id="0" precision="U8">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="RegexNormalization_66478" type="RegexNormalization" version="extension">
			<data global_replace="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>3</dim>
				</port>
				<port id="4" precision="U8">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="ByteFallback_66479" type="ByteFallback" version="extension">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="FuzeRagged_66480" type="FuzeRagged" version="extension">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_66482" type="Const" version="opset1">
			<data element_type="u8" shape="2" offset="466935" size="2" />
			<output>
				<port id="0" precision="U8">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_66484" type="Const" version="opset1">
			<data element_type="u8" shape="0" offset="466937" size="1" />
			<output>
				<port id="0" precision="U8">
					<dim>0</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="RegexNormalization_66485" type="RegexNormalization" version="extension">
			<data global_replace="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>2</dim>
				</port>
				<port id="4" precision="U8">
					<dim>0</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="UTF8Validate_66486" type="UTF8Validate" version="extension">
			<data replace_mode="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StringTensorPack_66487" type="StringTensorPack" version="opset15">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="STRING" names="Result_66488,string_output">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Result_66488" type="Result" version="opset1" output_names="Result_66488,string_output">
			<input>
				<port id="0" precision="STRING">
					<dim>-1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0" />
		<edge from-layer="1" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="3" from-port="0" to-layer="6" to-port="2" />
		<edge from-layer="4" from-port="0" to-layer="6" to-port="3" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="4" />
		<edge from-layer="6" from-port="7" to-layer="9" to-port="0" />
		<edge from-layer="6" from-port="8" to-layer="9" to-port="1" />
		<edge from-layer="6" from-port="9" to-layer="9" to-port="2" />
		<edge from-layer="6" from-port="5" to-layer="11" to-port="0" />
		<edge from-layer="6" from-port="6" to-layer="11" to-port="1" />
		<edge from-layer="7" from-port="0" to-layer="9" to-port="3" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="4" />
		<edge from-layer="9" from-port="5" to-layer="10" to-port="0" />
		<edge from-layer="9" from-port="6" to-layer="10" to-port="1" />
		<edge from-layer="9" from-port="7" to-layer="10" to-port="2" />
		<edge from-layer="10" from-port="3" to-layer="11" to-port="2" />
		<edge from-layer="10" from-port="4" to-layer="11" to-port="3" />
		<edge from-layer="10" from-port="5" to-layer="14" to-port="2" />
		<edge from-layer="11" from-port="4" to-layer="14" to-port="0" />
		<edge from-layer="11" from-port="5" to-layer="14" to-port="1" />
		<edge from-layer="12" from-port="0" to-layer="14" to-port="3" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="4" />
		<edge from-layer="14" from-port="5" to-layer="15" to-port="0" />
		<edge from-layer="14" from-port="6" to-layer="15" to-port="1" />
		<edge from-layer="14" from-port="7" to-layer="15" to-port="2" />
		<edge from-layer="15" from-port="3" to-layer="16" to-port="0" />
		<edge from-layer="15" from-port="4" to-layer="16" to-port="1" />
		<edge from-layer="15" from-port="5" to-layer="16" to-port="2" />
		<edge from-layer="16" from-port="3" to-layer="17" to-port="0" />
	</edges>
	<rt_info>
		<add_attention_mask value="True" />
		<add_prefix_space />
		<add_special_tokens value="True" />
		<bos_token_id value="1" />
		<chat_template value="{% for message in messages %}&#10;{% if message['role'] == 'user' %}&#10;{{ '&lt;|user|>&#10;' + message['content'] + eos_token }}&#10;{% elif message['role'] == 'system' %}&#10;{{ '&lt;|system|>&#10;' + message['content'] + eos_token }}&#10;{% elif message['role'] == 'assistant' %}&#10;{{ '&lt;|assistant|>&#10;'  + message['content'] + eos_token }}&#10;{% endif %}&#10;{% if loop.last and add_generation_prompt %}&#10;{{ '&lt;|assistant|>' }}&#10;{% endif %}&#10;{% endfor %}" />
		<clean_up_tokenization_spaces />
		<detokenizer_input_type value="i64" />
		<eos_token_id value="2" />
		<handle_special_tokens_with_re />
		<max_length />
		<number_of_inputs value="1" />
		<openvino_tokenizers_version value="2025.1.0.0-523-710ddf14de8" />
		<openvino_version value="2025.1.0-18503-6fec06580ab-releases/2025/1" />
		<original_post_processor_template value="{&quot;type&quot;: &quot;TemplateProcessing&quot;, &quot;single&quot;: [{&quot;SpecialToken&quot;: {&quot;id&quot;: &quot;&lt;s>&quot;, &quot;type_id&quot;: 0}}, {&quot;Sequence&quot;: {&quot;id&quot;: &quot;A&quot;, &quot;type_id&quot;: 0}}], &quot;pair&quot;: [{&quot;SpecialToken&quot;: {&quot;id&quot;: &quot;&lt;s>&quot;, &quot;type_id&quot;: 0}}, {&quot;Sequence&quot;: {&quot;id&quot;: &quot;A&quot;, &quot;type_id&quot;: 0}}, {&quot;SpecialToken&quot;: {&quot;id&quot;: &quot;&lt;s>&quot;, &quot;type_id&quot;: 1}}, {&quot;Sequence&quot;: {&quot;id&quot;: &quot;B&quot;, &quot;type_id&quot;: 1}}], &quot;special_tokens&quot;: {&quot;&lt;s>&quot;: {&quot;id&quot;: &quot;&lt;s>&quot;, &quot;ids&quot;: [1], &quot;tokens&quot;: [&quot;&lt;s>&quot;]}}}" />
		<original_tokenizer_class value="&lt;class 'transformers.models.llama.tokenization_llama_fast.LlamaTokenizerFast'>" />
		<pad_token_id value="2" />
		<processed_post_processor_template value="{&quot;single&quot;: {&quot;ids&quot;: [1, -1], &quot;type_ids&quot;: [0, 0]}, &quot;pair&quot;: {&quot;ids&quot;: [1, -1, 1, -2], &quot;type_ids&quot;: [0, 0, 1, 1]}}" />
		<sentencepiece_version value="0.2.0" />
		<skip_special_tokens value="True" />
		<streaming_detokenizer value="False" />
		<tokenizer_output_type value="i64" />
		<tokenizers_version value="0.21.1" />
		<transformers_version value="4.48.3" />
		<use_max_padding value="False" />
		<use_sentencepiece_backend value="False" />
		<utf8_replace_mode value="replace" />
		<with_detokenizer value="True" />
	</rt_info>
</net>
